In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Name": ["Advendio", "Anna", "Candy", "Joel", "Stephan"],
    "Major": ["DE", "DS", "DA", "DS", "DS"]
})

In [4]:
df

       Name Major
0  Advendio    DE
1      Anna    DS
2     Candy    DA
3      Joel    DS
4   Stephan    DS

In [6]:
df["Name - Major" ] = df["Name"] + " - " + df["Major"]

In [7]:
df

       Name Major   Name - Major
0  Advendio    DE  Advendio - DE
1      Anna    DS      Anna - DS
2     Candy    DA     Candy - DA
3      Joel    DS      Joel - DS
4   Stephan    DS   Stephan - DS